src/test/resources/jsonResponses/paymentInitiation/consent/paymentInitiationConsentResponse(WrongExpirationTimeTooYoung).json

{
    "data": {
        "consentId": "urn:bancoex:C1DD33123",
        "creationDateTime": "2021-05-21T08:30:00Z",
        "expirationDateTime": "2021-05-21T08:34:00Z",
        "statusUpdateDateTime": "2021-05-21T08:30:00Z",
        "status": "AWAITING_AUTHORISATION",
        "loggedUser": {
            "document": {
                "identification": "11111111111",
                "rel": "CPF"
            }
        },
        "businessEntity": {
            "document": {
                "identification": "11111111111111",
                "rel": "CNPJ"
            }
        },
        "creditor": {
            "personType": "PESSOA_NATURAL",
            "cpfCnpj": "58764789000137",
            "name": "Marco Antonio de Brito"
        },
        "payment": {
            "type": "PIX",
            "date": "2021-01-01",
            "currency": "BRL",
            "amount": "100000.12"
        },
        "debtorAccount": {
            "ispb": "12345678",
            "issuer": "1774",
            "number": "1234567890",
            "accountType": "CACC"
        }
    },
    "links": {
        "self": "https://api.banco.com.br/open-banking/api/v1/resource"
    },
    "meta": {
        "totalRecords": 1,
        "totalPages": 1,
        "requestDateTime": "2021-05-21T08:30:00Z"
    }
}
